{
  "main": {
    "title": "Events Hub",
    "description": "Events Hub - Your premier destination for events"
  },
  "common": {
  "events": "Events"
  },
  "home": {
    "title": "Welcome to Events Hub!",
    "carousel": {
      "1": {
        "title": "Welcome to Events Hub",
        "content": "Your one-stop destination for all your salon needs. Discover quality products, manage your business, and stay informed with our latest insights."
      }
    },
    "buttons": {
      "enter-events": "Enter Events",
      "create-event": "Create Event"
    }
  },
  "blogs": {
    "title": "Insights From Business Experts",
    "description": "Insights, tips, and real stories from the events industry. Learn, improve, and stay inspired."
  },
  "footer": {
    "copyright": "Events Hub"
  },
  "navigation": {
    "brand-name": "Events Hub",
    "home": "Home",
    "about": "About",
    "talent": "Talent",
    "opportunities": "Opportunities",
    "blog": "Blog",
    "pricing": "Pricing",
    "contact": "Contact",
    "login": "Login",
    "category": "Category"
  },
  "about": {
    "hero_tagline": "Connecting Talent with Opportunity in the Event Industry",
    "who_is_events_hubs": "Who is Events Hubs?",
    "who_is_events_hubs_description": "Since our inception in 2002, based in Jeddah of Saudi Arabia, we have successfully entered the world of Events Management and Organization, driven by a team of enthused and extremely competent individuals. With over 15 years of joint experiences, we bring the highest standards to the events we organize. We are keen to deliver avant-garde event solutions at first-class quality, setting the benchmark for the industry. From execution to conclusion, we've got your event covered, outstandingly serving you and uniquely providing added value to community. We move in line with the Kingdom's Vision 2030, which today sees entertainment as a significant component in the community. We declare our commitment as a hero in the event management, making sure that our major offerings to the Saudi social development can yield fruitful impact in the future.",
    "companies": "Companies",
    "recruitment": "Recruitment",
    "talents": "Talents",
    "why_events_hubs": "Why Events Hubs?",
    "why_events_hubs_description": "Here are some of our most asked questions, but feel free to visit our Help Center or contact our support team for further assistance.",
    "keen": "KEEN",
    "keen_description": "to work in partnership with the communities in which we operate. We create rigorous activities that bring us closer to our community individuals, where we can attentively listen to and respect their views, share their life's moments, interact with their environments, and more.",
    "smart": "SMART",
    "smart_description": "enough to understand our customer's needs. We are always eager to embrace their world, deploying our experiences to enable them to thrive. Our genuine and transparent solutions cover a host of different business needs; providing customers with valuable opportunity to live an engaging, enjoyable, and impactful experience.",
    "dedicated": "DEDICATED",
    "dedicated_description": "to providing the best quality service to meet customers' requirements. We are keen to deliver compelling innovation through proficient criterions, shrill initiatives, and passion to nurture customers' business.",
    "eager": "EAGER",
    "eager_description": "to deliver a number of initiatives that work in concert to contribute to events development. Our initiatives are designed to match one another for maximum integrated events, maintaining our values and principles. We are committed to achieving your organizational goals, through successful and memorable events.",
    "passionate": "PASSIONATE",
    "passionate_description": "about supporting talented youth who are the hope of future and source of creativity that is marching ahead. We care about outstanding capabilities; we encourage them to innovatively enrich the entertainment field, where we can bring events that are both theoretically and practically interesting.",
    "concerned": "CONCERNED",
    "concerned_description": "about knowledge. We believe that success is attributed to knowledge availability. We offer a wide range of methods that help support the Event Management industry. These methods include advanced training programs, modern digital means, and knowledgeable tools, to deliver unique event experiences that exceed customers’ expectations."
  }
}
